In [1]:
import pandas as pd

In [2]:
df = pd.DataFrame({
    'Company': ['A', 'A', 'A', 'B', 'B', 'B', 'B'],
    'Model': ['A1', 'A2', 'A3', 'B1', 'B2', 'B3', 'B4'],
    'Year': [2019, 2020, 2021, 2018, 2019, 2020, 2021],
    'Transmission': ['Manual', 'Automatic', 'Automatic', 'Manual', 'Automatic', 'Automatic', 'Manual'],
    'EngineSize': [1.4, 2.0, 1.4, 1.5, 2.0, 1.5, 1.5],
    'MPG': [55.4, 67.3, 58.9, 52.3, 64.2, 68.9, 83.1]
})

In [3]:
df

  Company Model  Year Transmission  EngineSize   MPG
0       A    A1  2019       Manual         1.4  55.4
1       A    A2  2020    Automatic         2.0  67.3
2       A    A3  2021    Automatic         1.4  58.9
3       B    B1  2018       Manual         1.5  52.3
4       B    B2  2019    Automatic         2.0  64.2
5       B    B3  2020    Automatic         1.5  68.9
6       B    B4  2021       Manual         1.5  83.1

In [4]:
# select the minimum for each company
df.groupby('Company')['MPG'].min()

Company
A    55.4
B    52.3
Name: MPG, dtype: float64

In [5]:
df = pd.DataFrame({'A':['yes','yes','yes','yes','no','no','yes','yes','yes','no'],
                   'B':['yes','no','no','no','yes','yes','no','yes','yes','no']})

In [6]:
df

     A    B
0  yes  yes
1  yes   no
2  yes   no
3  yes   no
4   no  yes
5   no  yes
6  yes   no
7  yes  yes
8  yes  yes
9   no   no

In [7]:
df.groupby(['A','B']).size()

A    B
no   no     1
     yes    2
yes  no     4
     yes    3
dtype: int64

In [8]:
# to restore the grouped columns, we call reset_index:
df.groupby(['A','B']).size().reset_index()

     A    B  0
0   no   no  1
1   no  yes  2
2  yes   no  4
3  yes  yes  3

In [9]:
# alternatively you can use value_counts
df.value_counts(ascending=True).reset_index()

     A    B  0
0   no   no  1
1   no  yes  2
2  yes  yes  3
3  yes   no  4

In [10]:
df = pd.DataFrame({'seat_id':[1,2,3,4,5],
                   'free'   :[1,0,1,1,1]})

In [11]:
df

   seat_id  free
0        1     1
1        2     0
2        3     1
3        4     1
4        5     1

In [12]:
df[abs(df['seat_id'] - df['seat_id']) == 1]

Empty DataFrame
Columns: [seat_id, free]
Index: []

In [13]:
df['cons'] = df.apply(lambda row : row['free'], axis = 1)

In [14]:
avail = 0
for index, row in df.iterrows():
    if row['free'] == 0:
        avail = 0
    else:
        avail += 1

In [15]:
# 1179. Reformat Department Table

In [16]:
Department = pd.DataFrame({'id'     :[1,2,3,1,1],
                           'revenue':[8000,9000,10000,7000,6000],
                           'month'  :['Jan','Jan','Feb','Feb','Mar']})

In [17]:
print(Department)

   id  revenue month
0   1     8000   Jan
1   2     9000   Jan
2   3    10000   Feb
3   1     7000   Feb
4   1     6000   Mar

In [18]:
Output = pd.DataFrame({'id' : Department['id'].unique()})

In [19]:
Department[Department['month']=='Jan'].rename(columns={'revenue':'Jan_Revenue'})

   id  Jan_Revenue month
0   1         8000   Jan
1   2         9000   Jan

In [20]:
for month in ['Jan', 'Feb', 'Mar']:
    Output = pd.merge(
                    Output,
                    Department[Department['month']==month],
                    how='left',
                    on=['id']).drop(columns=['month']).rename(columns={'revenue':month+'_Revenue'})

In [21]:
Output

   id  Jan_Revenue  Feb_Revenue  Mar_Revenue
0   1       8000.0       7000.0       6000.0
1   2       9000.0          NaN          NaN
2   3          NaN      10000.0          NaN

In [22]:
# 1789. Primary Department for Each Employee

In [23]:
Employee = pd.DataFrame({'employee_id':[1,2,2,3,4,4,4],
                        'department_id':[1,1,2,3,2,3,4],
                        'primary_flag':['N','Y','N','N','N','Y','N']})

In [24]:
print(Employee)

   employee_id  department_id primary_flag
0            1              1            N
1            2              1            Y
2            2              2            N
3            3              3            N
4            4              2            N
5            4              3            Y
6            4              4            N

In [25]:
tmp1 = Employee[Employee['primary_flag'] == 'Y']

In [26]:
employee_list = tmp1['employee_id'].unique()

In [27]:
tmp2 = Employee[~Employee['employee_id'].isin(employee_list)]

In [28]:
tmp1

   employee_id  department_id primary_flag
1            2              1            Y
5            4              3            Y

In [29]:
tmp2

   employee_id  department_id primary_flag
0            1              1            N
3            3              3            N

In [30]:
pd.concat([tmp1, tmp2]).sort_values(['employee_id'])

   employee_id  department_id primary_flag
0            1              1            N
1            2              1            Y
3            3              3            N
5            4              3            Y

In [31]:
# 178. Rank Scores
Scores = pd.DataFrame({'id':[1,2,3,4,5,6],
                       'score':[3.5,3.65,4.00,3.85,4.00,3.65]})
print(Scores)

   id  score
0   1   3.50
1   2   3.65
2   3   4.00
3   4   3.85
4   5   4.00
5   6   3.65

In [32]:
Scores.sort_values(['score'], ascending=False, inplace=True)

In [33]:
score_list = Scores.sort_values(['score'], ascending=False)['score'].unique()

In [34]:
Ranking = pd.DataFrame({'score': score_list,
                        'rank' : [i+1 for i in range(len(score_list))]})

In [35]:
pd.merge(Scores, Ranking, on='score', how='left').drop(columns=['id'])

   score  rank
0   4.00     1
1   4.00     1
2   3.85     2
3   3.65     3
4   3.65     3
5   3.50     4

In [36]:
# 511. Game Play Analysis I

In [37]:
Activity = pd.DataFrame({'player_id':[1,1,2,3,3],
                         'device_id':[2,2,3,1,4],
                         'event_date':[20160301,20160502,20170625,20160302,20180703],
                         'games_played':[5,6,1,0,5]})
print(Activity)

   player_id  device_id  event_date  games_played
0          1          2    20160301             5
1          1          2    20160502             6
2          2          3    20170625             1
3          3          1    20160302             0
4          3          4    20180703             5

In [38]:
Activity.groupby('player_id')['event_date'].min().reset_index().rename(columns={'event_date':
                                                                                'first_login'})

   player_id  first_login
0          1     20160301
1          2     20170625
2          3     20160302

In [39]:
# 512. Game Play Analysis II

In [40]:
Activity = pd.DataFrame({'player_id':[1,1,2,3,3],
                         'device_id':[2,2,3,1,4],
                         'event_date':[20160301,20160502,20170625,20160302,20180703],
                         'games_played':[5,6,1,0,5]})
print(Activity)

   player_id  device_id  event_date  games_played
0          1          2    20160301             5
1          1          2    20160502             6
2          2          3    20170625             1
3          3          1    20160302             0
4          3          4    20180703             5

In [41]:
tmp = Activity.groupby('player_id')['event_date'].min().reset_index().rename(columns={'event_date':
                                                                                      'first_login'})

for index, row in tmp.iterrows():
    tmp_ = Activity[(Activity['player_id'] == row['player_id']) & (Activity['event_date'] == row['first_login'])]
    print(tmp_)

   player_id  device_id  event_date  games_played
0          1          2    20160301             5
   player_id  device_id  event_date  games_played
2          2          3    20170625             1
   player_id  device_id  event_date  games_played
3          3          1    20160302             0

In [42]:
# 184. Department Highest Salary

In [46]:
Employee = pd.DataFrame({'player_id':[1,2,3,4,5],
                         'name':['joe','jim','henry','sam','max'],
                         'salary':[80,90,80,60,90],
                         'departmentId':[1,1,2,2,1]})
print(Employee)

   player_id   name  salary  departmentId
0          1    joe      80             1
1          2    jim      90             1
2          3  henry      80             2
3          4    sam      60             2
4          5    max      90             1

In [47]:
tmp = Employee.groupby('departmentId')['salary'].max().reset_index()
print(tmp)

   departmentId  salary
0             1      90
1             2      80

In [52]:
for index, row in tmp.iterrows():
    tmp_ = Employee[(Employee['departmentId'] == row['departmentId']) &
                    (Employee['salary'] == row['salary'])]
    print(tmp_)

   player_id name  salary  departmentId
1          2  jim      90             1
4          5  max      90             1
   player_id   name  salary  departmentId
2          3  henry      80             2

In [ ]:
# 1511. Customer Order Frequency

In [56]:
Customers = pd.DataFrame({'customer_id':[1,2,3],
                          'name':['Winston','Jonathan','Moustafa'],
                          'country':['USA','Peru','Egypt']})
Product = pd.DataFrame({'product_id':[10,20,30,40],
                        'price':[300,10,45,2]})
Orders = pd.DataFrame({'order_id':[1,2,3,4,5,6,7,9],
                       'customer_id':[1,1,1,2,2,3,3,3],
                       'product_id':[10,20,30,10,40,20,30,30],
                       'order_date':['2020-06-10','2020-07-01','2020-07-08','2020-06-15','2020-07-01','2020-06-24','2020-06-25','2020-05-08'],
                       'quantity':[1,1,2,2,10,2,2,3]})

In [62]:
Master = pd.merge(Orders, Product, how='left', on='product_id')

In [63]:
Master = pd.merge(Master, Customers, how='left', on='customer_id')
print(Master)

   order_id  customer_id  product_id  order_date  quantity  price      name  \
0         1            1          10  2020-06-10         1    300   Winston
1         2            1          20  2020-07-01         1     10   Winston
2         3            1          30  2020-07-08         2     45   Winston
3         4            2          10  2020-06-15         2    300  Jonathan
4         5            2          40  2020-07-01        10      2  Jonathan
5         6            3          20  2020-06-24         2     10  Moustafa
6         7            3          30  2020-06-25         2     45  Moustafa
7         9            3          30  2020-05-08         3     45  Moustafa

  country
0     USA
1     USA
2     USA
3    Peru
4    Peru
5   Egypt
6   Egypt
7   Egypt

In [89]:
Master['TotalPrice'] = Master.apply(lambda row: row['price'] * row['quantity'], axis = 1)
print(Master)

   order_id  customer_id  product_id  order_date  quantity  price      name  \
0         1            1          10  2020-06-10         1    300   Winston
1         2            1          20  2020-07-01         1     10   Winston
2         3            1          30  2020-07-08         2     45   Winston
3         4            2          10  2020-06-15         2    300  Jonathan
4         5            2          40  2020-07-01        10      2  Jonathan
5         6            3          20  2020-06-24         2     10  Moustafa
6         7            3          30  2020-06-25         2     45  Moustafa
7         9            3          30  2020-05-08         3     45  Moustafa

  country  TotalPrice
0     USA         300
1     USA          10
2     USA          90
3    Peru         600
4    Peru          20
5   Egypt          20
6   Egypt          90
7   Egypt         135

In [95]:
t1 = Master[(Master['order_date'] >= '2020-06-01') & (Master['order_date'] <= '2020-06-30')].groupby('name').sum().reset_index()

In [103]:
t1[t1['TotalPrice'] >= 100][['name','TotalPrice']]

       name  TotalPrice
0  Jonathan         600
1  Moustafa         110
2   Winston         300

In [97]:
t2 = Master[(Master['order_date'] >= '2020-07-01') & (Master['order_date'] <= '2020-07-31')].groupby('name').sum().reset_index()

In [104]:
t2[t2['TotalPrice'] >= 100][['name','TotalPrice']]

      name  TotalPrice
1  Winston         100

In [106]:
namelist = pd.merge(t1[t1['TotalPrice'] >= 100], t2[t2['TotalPrice'] >= 100], how='inner', on='name')['name']

In [111]:
Customers[Customers['name'].isin(namelist)][['customer_id','name']]

   customer_id     name
0            1  Winston